In [2]:
import warnings
warnings.filterwarnings('ignore')

import numpy as np
import pandas as pd

In [3]:
data = {
    'worker_id': [1, 2, 3, 4, 5],
    'first_name': ['Monika', 'Niharika', 'Vishal', 'Amitah', 'Vivek'],
    'last_name': ['Arora', 'Verma', 'Singhal', 'Singh', 'Bhati'],
    'salary': [100000, 80000, 300000, 500000, 500000],
    'joining_date': ['2014-02-20 00:00:00', '2014-06-11 00:00:00', '2014-02-20 00:00:00', '2014-02-20 00:00:00', '2014-06-11 00:00:00'],
    'department': ['HR', 'Admin', 'HR', 'Admin', 'Admin']
}

df = pd.DataFrame(data)
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00      Admin

In [18]:
# observations

# idmin 
# count will give the counbt of ONLY non-null values
# sum will give the count of null and non-null values

In [4]:
#10 COUNT Questions

# How many non-null values are there in the salary column?
# Across all columns, which column has the least non-null values?
# Using the count method, how many non-null entries are there in each of the columns in the DataFrame?
# In the department column, how many non-null entries are present?
# By grouping by the department, how many non-null first_name entries are there for each department?
# Group by joining_date and count how many workers joined on each distinct date.
# How many workers have non-null last_name entries in the DataFrame?
# By filtering the DataFrame for salary above 200000, how many non-null worker_id entries are present in the filtered data?
# By grouping by both department and joining_date, how many non-null salary entries are there for each combination?
# In the df, excluding the worker_id column, which columns have exactly 5 non-null values?

In [6]:
#10 VALUE_COUNTS() Questions

# Question #1: Which first_name appears the most in the dataset?

# Question #2: How many unique department names are there in the dataset and what are their counts?

# Question #3: Which joining_date is the most common among the workers?

# Question #4: Are there any last_name values that appear more than once? If so, which ones?

# Question #5: Using value_counts(), determine how many workers have salaries equal to 500000.

# Question #6: Which salary amount appears the least frequently in the dataset?

# Question #7: Use value_counts() to determine the number of workers in each department and sort the output by the department names.

# Question #8: How many workers have the same first_name and last_name combinations? Use value_counts() on multiple columns to determine this.

# Question #9: Can you display the frequency of each unique salary value in descending order?

# Question #10: Using value_counts(), how many workers joined on each unique date? Display the results in ascending order based on counts.

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00      Admin

In [9]:
#1
df['salary'].count()

5

In [15]:
#2 
# Across all columns, which column has the least non-null values?
df.count()

worker_id       5
first_name      5
last_name       5
salary          5
joining_date    5
department      5
dtype: int64

In [17]:
df.count().idxmin()

'worker_id'

In [19]:
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00      Admin

In [20]:
df['department'].count()

5

In [21]:
df['salary'].nunique()

4

In [22]:
df['joining_date'].count()

5

In [23]:
df['last_name'].count()

5

In [24]:
df['first_name'].count()

5

In [26]:
df.first_name.value_counts().idxmax()

'Monika'